// 47). В retriveLocalStorage в середині буде дженерік <T>, в дужках ми будемо визначати що ми в LocalStorage по
// якому ключу хочемо знайти, а далі всі інші процеси.
export const retriveLocalStorage = <T>(key: string) => {
    // 48). Ми б мали робити JSON.parse(localStorage.getItem('user')).accessToken, але тут буде помилка, бо коли ми
    // витягаємо юзера з локалстореджа і потім його парсуємо, то JSON.parse не типізує вам нічого. В нас прилітає
    // обєкт типу any. Це вирішується в цьому описі.
    // Ми будемо робити те саме, тобто будемо діставати з localStorage по ключу, а не по конкретному значенню
    // ('user'). Тому цей метод буде працювати не з однією сутністю. Потенційно object може бути null, бо якщо
    // такого ключа key (такого ключа 'key' не існує, його потрібно передати як змінну key, а не як стрінгу), який
    // ми будемо вписувати, не буде існувати в нашому localStorage, то нам нічого не повертається. А сюди повинно
    // щось повертатись. Відоповідно ми будемо казати, або тут буде прилітати обєкт, або нічого, але стрінгового
    // типу, бо object має бути стрінгового типу.
    const object = localStorage.getItem(key) || '';
    // 49). Далі робимо перевірку: у випадку якщо object-а не існує (!object) - ми будемо повертати пустий обєкт
    // строго типізований як тип даних <T>, але прописуємо без <>.
    if (!object) {
        return {} as T;
    }
    // 50). У випадку, якщо цього не станеться, ми зробимо змінну напр. parse в якій буде JSON.parse і цей object.
    const parse = JSON.parse(object);
    // 51). Будемо повертати цей parse строго типізований (примусово типізований хардкодом) як окрем змінна.
    // Відповідно тепер переходимо в api.service.ts.
    return parse as T;

}