// 16). Створюємо AuthResourcesPage. Далі йдем в main.tsx
import {useEffect} from "react";
import {loadAuthProducts, refresh} from "../services/api.service.ts";

export const AuthResourcesPage = () => {

    // 32). Створюємо useEffect.
    useEffect(() => {
        // 33). Створюємо ф-ію loadAuthProducts (назва довільна). Вона повинна підвантажувати продукти з
        // аутентифікованої точки. Відповідно переходим в api.service.ts, бо це має бути там. Копіюємо назву
        // loadAuthProducts.
        // 43). Імпортуємо loadAuthProducts, після цього в нас формується then, отримуємо value, з яким ми маємо
        // щось робити. value це і є products. Зразу бачимо їх тип.
        loadAuthProducts().then(products => {
            // 44). Виводимо products. Але тут виводу не буде: отримуємо статус 401. Ми не аутентифіковані. Бо коли
            // в api.service.ts робиться запит loadAuthProducts йому додатково потрібні ще наші токени (в дужках
            // після урли). Але ми ще будемо робити запити на урлу юзерс, картс ітд. (на всі ресурси, які
            // відносятсья до аутентифікації). В нас може бути один генералізований метод, який спроможний буде
            // звертатись на різні ендпоінти (але тоді не забудьте використати дженерік). Або буде декілька
            // різноманітних методів, які будуть робити майже одне і те саме. І тоді кожного разу в дужках після
            // урли треба буде передавати токен. Тобто потенційно може бути кілька таких методів, в яких потрібно
            // буде одне і те саме робити. Але це не потрібно. Є механізм в axios, який дозволя брати будь-які
            // запити, які ми робимо, або той, який нам потрібний, і додавати до нього ці хедери самостійно. В axios
            // це є в розділі headers. Але нам потрібно не на всі урли. Переходимо в api.service.ts.
            console.log(products)
        //  65). У випдку, якщо у нас щось стається, в нас стається catch. Тобто, якщо є помилка, є catch, є причина
            //  цього catch-а.
        }).catch(reason => {
            // 66). Спеціально будемо виводити причину catch-а, щоб в дужках не сварилось що змінна не викор-ся. Але
            // ми можемо ще в повідомлення побачити статус код помилки. Так що пригодиться.
            console.log(reason);
            // 67). Виконуємо процес refresh-у. Під час виконання цього процесу ми будемо робити запит: тобто
            // виконовуати всю дію refresh з api.service.ts.: робити запит, отримувати нову пару ключів. Тому ми ще
            // раз попросимо: давай нам ще раз завантаж продукти(loadAuthProducts()), бо перший раз ніби не пішло.
            // Дужки з value можна залишити пусті, або прописувати консоль.лог за value, щоб не валило помилки. Тут
            // робимо інлайн-конструкцію. Тому ми можемо в кінці отримати value і вивести ці продукти.
            refresh()
                .then(() => loadAuthProducts())
                .then(value => console.log(value))
        })

    }, []);

    return (
        <>
            AuthResourcesPage
        </>
    );
};